# Куб з довжиною ребра х розміщено у просторі так, що його грані паралельні координатним площинам,
# а точка перетину діагоналей співпадає з центром координат. 
# Користувач задає координати точки у просторі,
# а програма повинна визначити належність точки цьому кубу

x = float(input("cube length:")) /2

x1 = abs(float(input("Enter х:")))
y1 = abs(float(input("Enter y:")))
z1 = abs(float(input("Enter z:")))

if x1<=x and y1<=x and z1<=x:
    print("Belong")

else:
    print("Don't belong")    